#tap "codacy/tap"
#tap "codefresh-io/cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
#tap "mongodb/brew"
tap "weaveworks/tap"
tap "little-angry-clouds/homebrew-my-brews"
tap "liamg/tfsec"
tap "paulp/extras"

brew "zsh"
brew "coreutils"
brew "git"
brew "jq"
brew "mas"
brew "wget"
brew "thefuck"
brew "yq"
cask "iterm2"
#cask "little-snitch"
brew "gnupg"
cask "logseq"

brew "awscli"

#cask "google-chrome"
cask "visual-studio-code"
#mas "Enpass", id: 732710998
#mas "Magnet", id: 441258766
cask "slack"
#cask "backblaze"
cask "authy"
cask "zoom"
cask "alfred"

brew "azure-cli"
brew "adr-tools"
brew "checkov"
brew "gh"
brew "helm"
brew "kubectx"
brew "pre-commit"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "weaveworks/tap/eksctl"
#cask "backblaze-downloader"
cask "docker"
#cask "dropbox"
#cask "evernote"
cask "font-consolas-for-powerline"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-powerline-symbols"
cask "font-meslo-lg-nerd-font"
cask "jetbrains-toolbox"
#cask "keybase"
cask "eul"
cask "paw"
#cask "microsoft-auto-update"
#cask "microsoft-office"
cask "skitch"
#cask "spotify"
#cask "virtualbox"
#cask "virtualbox-extension-pack"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
#cask "tunnelbear"

mas "Pages", id: 409201541
mas "Keynote", id: 409183694
#mas "Debit & Credit", id: 882637653
mas "Numbers", id: 409203825
mas "HP Smart", id: 1474276998

# Java
brew "jenv"
#brew "openjdk"
#brew "maven"
#brew "openjdk@11"
#brew "openjdk@8"

# Node
brew "nvm"

# Python
brew "python@3.10"

# Golang
brew "go"
brew "tekwizely/tap/bingo"

# client
brew "kind"
cask "microsoft-teams"
#brew "glab"
cask "vmware-horizon-client"
