tap "weaveworks/tap"
tap "little-angry-clouds/homebrew-my-brews"
tap "liamg/tfsec"
tap "paulp/extras"
tap "tekwizely/tap"

brew "zsh"
brew "coreutils"
brew "git"
brew "jq"
brew "mas"
brew "wget"
brew "thefuck"
brew "yq"
brew "openssh"
cask "iterm2"
brew "gnupg"
cask "logseq"
cask "grammarly-desktop"

brew "awscli"
cask "gcloud-cli"

cask "google-chrome"
cask "visual-studio-code"
mas "Enpass", id: 732710998
cask "rectangle"
cask "slack"
cask "backblaze"
cask "zoom"
cask "alfred"

brew "azure-cli"
brew "adr-tools"
brew "checkov"
brew "gh"
brew "helm"
brew "kubectx"
brew "pre-commit"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "weaveworks/tap/eksctl"
cask "backblaze-downloader"
brew "colima"
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "docker-credential-helper"
cask "dropbox"
cask "font-consolas-for-powerline"
cask "font-inconsolata"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-for-powerline-bold"
cask "font-powerline-symbols"
cask "font-meslo-lg-nerd-font"
cask "jetbrains-toolbox"
cask "keybase"
cask "eul"
cask "rapidapi"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-edge"
cask "shottr"
cask "claude-code"
cask "cursor"
cask "codex"

cask "spotify"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "steam"

mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Debit & Credit", id: 882637653
mas "Numbers", id: 409203825

# Java
brew "jenv"
#brew "openjdk"
#brew "maven"

# Node
brew "nvm"

# Python
brew "python@3.14"

# Golang
brew "go"
brew "tekwizely/tap/bingo"

# client
brew "kind"
#brew "glab"
#cask "vmware-horizon-client"
#cask "aws-vpn-client"
#cask "webex-meetings"
brew "saml2aws"
